export const menuLink = [
  {
    id: 0,
    text: 'О компании',
    slug: '/about'
  },
  {
    id: 1,
    text: 'Контрактное производство',
    slug: '/'
  },
  {
    id: 2,
    text: 'Собственные торговые марки',
    slug: '/'
  },
  {
    id: 3,
    text: 'Новости',
    slug: '/'
  },
  {
    id: 4,
    text: 'Контакты',
    slug: '/'
  },
]

export const Contact = [
  {
    id: 0,
    contactInfo: '+7 (499) 686-10-14'
  },
  {
    id: 1,
    contactInfo: 'Получить консультацию'
  },
]

export const slides = [
  {
    id: 0,
    title: "Комплексное обеспечение товарами и расходными материалами бизнеса",
    description: "Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высококачественный прототип будущего проекта напрямую зависит от анализа существующих паттернов поведения.",
  },
  {
    id: 1,
    title: "Контрактное производство и расходными материалами бизнеса",
    description: "Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высококачественный прототип будущего проекта напрямую зависит от анализа существующих паттернов поведения.",
  },
  {
    id: 2,
    title: "Собственные бренды и расходными материалами бизнеса",
    description: "Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высококачественный прототип будущего проекта напрямую зависит от анализа существующих паттернов поведения.",
  },
];

// data.js
import { FaHourglassHalf, FaCertificate, FaUserCheck, FaTruck, FaIndustry } from "react-icons/fa";

export const advantages = [
  {
    id: 1,
    icon: FaHourglassHalf,
    title: "Непрерывная работа с 2017 года",
  },
  {
    id: 2,
    icon: FaCertificate,
    title: "Вся продукция сертифицирована",
  },
  {
    id: 3,
    icon: FaUserCheck,
    title: "Контроль качества на всех этапах",
  },
  {
    id: 4,
    icon: FaTruck,
    title: "Возможны поставки по всей России",
  },
  {
    id: 5,
    icon: FaIndustry,
    title: "Оперативное производство",
  },
];

export const workScheme = [
  {
    id: 1,
    title: 'Знакомство',
    description: 'Безусловно, сплочённость команды профессионалов позволяет оценить значение форм воздействия.',
  },
  {
    id: 2,
    title: 'Заключение договора',
    description: 'Лишь интерактивные прототипы призваны к ответу.',
  },
  {
    id: 3,
    title: 'Производство',
    description: 'А также стремящиеся вытеснить традиционное производство, нанотехнологии функционально разнесены на независимые элементы.',
  },
  {
    id: 4,
    title: 'Доставка',
    description: 'В частности, экономическая повестка сегодняшнего дня говорит о возможностях приоритизации разума над эмоциями.',
  },
];

import img1 from "../assets/avto-him.png"
import img2 from "../assets/himchistka.png"
import img3 from "../assets/dezinfect.png"

export const productCategories = [
  {
    id: 0,
    title: "Автомобильная химия",
    description:
      "Бережно, эффективно и надежно устраняет загрязнения, придает блеск и защищает.",
    image: img1,
  },
  {
    id: 1,
    title: "Бытовая химия",
    description:
      "А также производство чистящих, туалетных, функциональных, моющих средств для дома и личной гигиены.",
    image: img2,
  },
  {
    id: 2,
    title: "Дезинфицирующие средства",
    description:
      "Линия препаратов противовирусного и противомикробного спектра.",
    image: img3,
  },
  {
    id: 3,
    title: "Пищевые аэрозоли",
    description:
      "Безопасные аэрозоли для кулинарного применения и антипригарной обработки.",
    image: img3,
  },
  {
    id: 4,
    title: "Косметическая продукция",
    description:
      "Широкий ассортимент гигиенических и косметических средств.",
    image: img2,
  },
  {
    id: 5,
    title: "Краски аэрозольные",
    description:
      "Аэрозольные краски для бытового и профессионального применения.",
    image: img1,
  },
];

export const blogPosts = [
  {
    id: 0,
    title: "Современная методология разработки одухотворила всех причастных",
    excerpt:
      "Укрепление и развитие структуры способствует подготовке и реализации новых предложений.",
    image: '/image/Group31.png',
  },
  {
    id: 1,
    title: "Сложно сказать, почему жизнь прекрасна",
    excerpt:
      "Сложно сказать, почему именно, но дальнейшее развитие различных форм деятельности способствует повышению качества.",
    image: '/image/Group32.png',
  },
  {
    id: 2,
    title: "Современная методология разработки одухотворила всех причастных",
    excerpt:
      "Укрепление и развитие структуры способствует подготовке и реализации новых предложений.",
    image: '/image/Group31.png',
  },
  {
    id: 3,
    title: "Сложно сказать, почему жизнь прекрасна",
    excerpt:
      "Сложно сказать, почему именно, но дальнейшее развитие различных форм деятельности способствует повышению качества.",
    image: '/image/Group32.png',
  },
  {
    id: 4,
    title: "Современная методология разработки одухотворила всех причастных",
    excerpt:
      "Укрепление и развитие структуры способствует подготовке и реализации новых предложений.",
    image: '/image/Group31.png',
  },
  {
    id: 5,
    title: "Сложно сказать, почему жизнь прекрасна",
    excerpt:
      "Сложно сказать, почему именно, но дальнейшее развитие различных форм деятельности способствует повышению качества.",
    image: '/image/Group32.png',
  },
];

// footer 

export const footerData = [
  {
    id: 0,
    title: "Контрактное производство",
    links: [
      { li: "Автомобильная химия", href: "#", id: 0, },
      { li: "Бытовая химия", href: "#", id: 1, },
      { li: "Дезинфицирующие средства", href: "#", id: 2, },
    ],
  },
  {
    id: 1,
    title: "Собственные марки",
    links: [
      { li: "Автохимия AG-Tech", href: "#", id: 0, },
      { li: "Автохимия AP", href: "#", id: 1, },
    ],
  },
  {
    id: 2,
    title: "О компании",
    links: [
      { li: "Новости", href: "#", id: 0, },
      { li: "Контакты", href: "#", id: 1, },
    ],
  },
];

import gril from "../assets/gril.png"

export const productionData = [
  {
    id: 0,
    title: "НАШЕ ПРОИЗВОДСТВО",
    description: `Предварительные выводы неустрашимые: разбавление ядерной долей эмпатии, радикальное мышление обеспечивает широкому кругу (специалистов) участие в формировании глубокоуважаемых рассуждений. Но граница обучения кадров создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса кластеризации усилий.
  
  Реализация ключевых положений задания, а также свежий взгляд на привычные вещи – всесторонне охватывает новые горизонты для соответствующих условий активизации. Предварительные выводы неустрашимые: экономическая повестка сегодняшнего дня требует анализа значимости существующих партнёров по проекту.`,
    image: gril,
  },
];